#!/bin/bash

# Перша строка скрипту - шебанг
# Шебанг вказує системі яку програму слід використовувати для запуску скрипта
# Можна використовувати env для отримання шляху інтерпритатора, наприклад: #!/usr/bin/env SHELL
# Усі наступні строки, які починаються із символу "#" є коментарями

whoami ; pwd

# Виконання двох команд:
# whoami - відображає логін користувача
# pwd - відображає шлях до робочого каталогу
# При записі команд в рядок вони повинні бути розділені знаком ";"
# Можна записувати скільки завгодно команд в один рядок
# Обмеження максимальної кількості аргументів для одного рядка - getconf ARG_MAX

# Команди простіше записувати окремо
# При такому записі команди розділяються символом переводу строки

# Для того щоб зробити скрипт виконуваним потрібно виконати команду - chmod +x ./script.sh
# Для запуску скрипта використовується наступна команда - ./script.sh
